2 задача
-----------------------------------------------------------------------
# Ввод 11 символов
print("Введите 11 символов: ")
input_str = input()[:11]  # Берем первые 11 символов

# Массив символов
char_array = list(input_str)

# Преобразование строчных букв в верхний регистр
result = [char.upper() if char.islower() else char for char in char_array]

# Вывод
print(f"Исходно: {input_str}")
print(f"Результат: {''.join(result)}")
-----------------------------------------------------------------------
3 задача
-----------------------------------------------------------------------
# Ввод 12 символов
print("Введите 12 символов: ")
input_str = input()[:12]  # Берем первые 12 символов

# Массив символов
char_array = list(input_str)

# Заменяем цифры на "!"
result = ['!' if char.isdigit() else char for char in char_array]

# Вывод
print(f"Исходно: {input_str}")
print(f"Массив: {char_array}")
print(f"Результат: {''.join(result)}")
-----------------------------------------------------------------------
