2 задача
-----------------------------------------------------------------------
# ввод 11 символов
print("введите 11 символов: ")
input_str = input()[:11]  # Берем первые 11 символов

# массив символов
char_array = list(input_str)

# преобразование строчных букв в верхний регистр
result = [char.upper() if char.islower() else char for char in char_array]

# вывод
print(f"исходно: {input_str}")
print(f"результат: {''.join(result)}")

-----------------------------------------------------------------------
3 задача
-----------------------------------------------------------------------
# ввод 12 символов
print("введите 12 символов: ")
input_str = input()[:12]  # берем первые 12 символов

# массив символов
char_array = list(input_str)

# заменяем цифры на "!"
result = ['!' if char.isdigit() else char for char in char_array]

# вывод
print(f"исходное: {input_str}")
print(f"результат: {''.join(result)}")


-----------------------------------------------------------------------
15 задача
-----------------------------------------------------------------------
input_str = input("введите строку: ")

# преобразуем строку в массив символов
char_array = list(input_str)

# переменные для подсчета
removed_count = 0
result_array = []

# проходим по каждому из символов
for char in char_array:
    if char == ':':
        # если символ это двоеточие - счетчик увеличиваеться
        removed_count += 1
    else:
        # иначе добовляем в новый массив (символ)
        result_array.append(char)

# преобразуем результат обратно в строку
result_str = ''.join(result_array)

# вывод результатов
print(f"после удаления двоеточий: {result_str}")
print(f"удаленных символов ':' - {removed_count}")
